In [47]:
import pandas as pd

In [49]:
df = pd.read_excel("SalesData.xlsx", engine='openpyxl') 
df.to_csv("SalesData.csv", index=False)

In [51]:
df.head()

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
0,2018-01-06,East,Martha,Alexander,Television,95,1198.0,113810.0
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50,500.0,25000.0
2,2018-02-09,Central,Hermann,Luis,Television,36,1198.0,43128.0
3,2018-02-26,Central,Timothy,David,Cell Phone,27,225.0,6075.0
4,2018-03-15,West,Timothy,Stephen,Television,56,1198.0,67088.0

In [53]:
df["Item"].unique()

array(['Television', 'Home Theater', 'Cell Phone', 'Desk', 'Video Games'],
      dtype=object)

Question_1

In [56]:
df.groupby("Item")["Sale_amt"].min()

Item
Cell Phone      3375.0
Desk             250.0
Home Theater    2000.0
Television      8386.0
Video Games      936.0
Name: Sale_amt, dtype: float64

Question_2

In [59]:
df['OrderDate'] = pd.to_datetime(df['OrderDate'])
df['Year']=df['OrderDate'].dt.year
total_sales=df.groupby(['Year', 'Region'])['Sale_amt'].sum()
total_sales

Year  Region
2018  Central    479825.0
      East       293780.0
      West       105424.0
2019  Central    349944.5
      East        27227.0
      West        49475.0
Name: Sale_amt, dtype: float64

Question_3

In [84]:
reference_date = pd.to_datetime("2018-01-01")
df['days_diff']=(df['OrderDate']-reference_date)

In [86]:
df.head()

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt,Year,days_diff
0,2018-01-06,East,Martha,Alexander,Television,95,1198.0,113810.0,2018,5 days
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50,500.0,25000.0,2018,22 days
2,2018-02-09,Central,Hermann,Luis,Television,36,1198.0,43128.0,2018,39 days
3,2018-02-26,Central,Timothy,David,Cell Phone,27,225.0,6075.0,2018,56 days
4,2018-03-15,West,Timothy,Stephen,Television,56,1198.0,67088.0,2018,73 days

Question_4

In [95]:
new_df= df.groupby('Manager')['SalesMan'].apply(list).reset_index()
new_df.columns = ['manager', 'list_of_salesmen']
new_df

   manager                                   list_of_salesmen
0  Douglas  [Michael, Karen, John, Karen, John, Karen, Joh...
1  Hermann  [Shelli, Luis, Luis, Sigal, Sigal, Shelli, Lui...
2   Martha  [Alexander, Alexander, Steven, Alexander, Dian...
3  Timothy  [David, Stephen, David, Stephen, David, David,...

Question_5

In [100]:
regions=df.groupby('Region').agg({
    'SalesMan': 'nunique',     
    'Sale_amt': 'sum'         
}).reset_index()
regions.columns = ['Region', 'salesmen_count', 'total_sales']
regions

    Region  salesmen_count  total_sales
0  Central               6     829769.5
1     East               3     321007.0
2     West               2     154899.0

Question_6

In [103]:
manager_sales=df.groupby('Manager')['Sale_amt'].sum().reset_index()
total_sales=manager_sales['Sale_amt'].sum()
manager_sales['percentage_sales']=(manager_sales['Sale_amt']/total_sales)*100
manager_percentage_sales=manager_sales.drop('Sale_amt',axis=1)
manager_percentage_sales

   Manager  percentage_sales
0  Douglas         18.308990
1  Hermann         27.963188
2   Martha         36.187629
3  Timothy         17.540193